[
  {
    "id": 1,
    "title": "Top 5 Tips for Preparing Your First Marathon",
    "author": "Md. Maidul Islam",
    "date": "2025-06-30",
    "image": "https://i.ibb.co/jPSh0z62/Bid2-min.png",
    "excerpt": "Marathon for beginners can seem daunting. Here are five simple tips to train smarter and finish strong.",
    "content": "1. Start early – Begin training at least 8–12 weeks ahead.\n2. Follow a training plan – Stick to a beginner-friendly schedule.\n3. Hydration & nutrition – Drink water regularly and maintain a balanced diet.\n4. Get proper gear – Use a good pair of running shoes and breathable clothes.\n5. Rest is key – Don’t ignore rest days; recovery will help you run better on race day.\n\nPrepare patiently and enjoy every step of your marathon journey!"
  },
  {
    "id": 2,
    "title": "Nutrition For Runners: What To Eat Before And After",
    "author": "Run Expert",
    "date": "2025-06-25",
    "image": "https://i.ibb.co/Zprwwbdz/Banner-min.jpg",
    "excerpt": "Fueling your body the right way helps improve performance and recovery. Let’s dive into what matters most.",
    "content": "Before a run: Eat complex carbs like oatmeal, banana, or whole-grain toast 1.5–2 hours before.\nDuring: For longer races, energy gels or a sports drink every 45–60 minutes.\nAfter: Focus on protein-rich meals with good carbs – e.g., a chicken sandwich or Greek yogurt + fruit.\n\nPace your meals with your runs and avoid running immediately after eating to avoid cramps."
  },
  {
    "id": 3,
    "title": "Must-Have Gear for Every Marathon Runner",
    "author": "Sports Weekly",
    "date": "2025-06-20",
    "image": "https://i.ibb.co/nyW502w/Bid3-min.png",
    "excerpt": "From shoes to hydration belts, here’s what you need in your gear list before hitting the marathon track.",
    "content": "Essential gear includes:\n- Running Shoes: Choose ones that suit your gait.\n- Moisture-Wicking Clothing: Keeps you dry and comfortable.\n- Hydration Belt or Vest: Carry water or electrolytes for long runs.\n- GPS Smartwatch: Track your distance and pace.\n- Anti-Chafing Cream: Prevents skin irritation.\n\nMake a checklist before every event to avoid missing key items."
  }
]